const results = {
    100: "موفق",
    102: "merchant یافت نشد.",
    103: "merchant غیرفعال است. با پشتیبانی تماس حاصل کنید.",
    104: "merchantId نامعتبر است.",
    105: "مبلغ باید از 1,000 ریال بزرگتر باشد",
    106: "callbackUrl نامعتبر است.",
    113: "مبلغ باید از 500,000,000 ریال کمتر باشد.",
    140: "callbackUrl ارسال نشده.",
    201: "قبلا تایید شده.",
    202: "سفارش پرداخت نشده یا ناموفق بوده است.",
    203: "trackId نامعتبر است.",
    "-1": "خطا"
};

const statuses = {
    "-100": "خطا",
    "-1": "در انتظار پرداخت",
    "-2": "خطای داخلی",
    1: "پرداخت شده - تاییدشده",
    2: "پرداخت شده - تاییدنشده",
    3: "لغوشده توسط کاربر",
    4: "شماره کارت نامعتبر",
    5: "موجودی حساب ناکافی",
    6: "رمز اشتباه",
    7: "تعداد درخواست‌ها بیش از حد مجاز",
    8: "تعداد پرداخت اینترنتی روزانه بیش از حد مجاز",
    9: "مبلغ پرداخت اینترنتی روزانه بیش از حد مجار",
    10: "صادرکننده کارت نامعتبر",
    11: "خطای سوییچ",
    12: "کارت غیرقابل دسترسی",
}

export default {
    getPersianMessage: (result: any = -1) => {
        return results[result];
    },
    getPersianStatus: (status: any = -100) => {
        return statuses[status]
    }
}